In [ ]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [5]:
import sqlite3
from sqlalchemy import create_engine

# *FROM_DB:*

In [ ]:
# Create the connection
cnx = sqlite3.connect('test.db')

In [1]:
# pull data into DATAFRAME
df = pd.read_sql_query("SELECT * FROM contacts", cnx)

In [2]:
df

   ID              NAME              EMAIL   TYPE  TIMESTAMP  SENT
0   1  Larry Fitzgerald  fitzy@phoenix.edu    WEB       1981     0
1   2  Larry Fitzgerald  fitzy@phoenix.edu    WEB       1981     0
2   3  Larry Fitzgerald  fitzy@phoenix.edu    WEB       1981     0
3   4  Larry Fitzgerald  fitzy@phoenix.edu    WEB       1981     0
4   5  Larry Fitzgerald  fitzy@phoenix.edu    WEB       1981     0
5   6  Larry Fitzgerald  fitzy@phoenix.edu    WEB       1982     1
6   7    Michael Thomas   ixnay@hombre.com    WEB       1983     1
7   8    Michael Thomas   ixnay@hombre.com    WEB       1985     0
8   9  Larry Fitzgerald  fitzy@phoenix.edu  EMAIL       1993     0

# *TO_DB:*

In [3]:
my_data = pd.DataFrame([[1, 2], [3, 5]])
my_data

   0  1
0  1  2
1  3  5

In [6]:
# create ENGINE (for sending **to** database)
engine = create_engine("sqlite:///test.db")

In [9]:
my_data.to_sql("my_table", engine, index=False)

ValueError: Table 'my_table' already exists.

In [8]:
df_new = pd.read_sql_query("SELECT * FROM my_table", cnx)
df_new

   index  0  1
0      0  1  2
1      1  3  5